app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."name" = $1 LIMIT 1  [["name", "Banana, raw"]]
SELECT  "foods".* FROM "foods" WHERE (Anchovy, canned) LIMIT 1
---
  def create
    @entry = Entry.find_by(id:params[:entry_id])
    food_attr = params.require(:food).permit(:food_name)
    @food = Food.find_by(name: food_attr[:food_name])
    if Food.exists?(name: food_attr[:food_name])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 9]]
---
  def show
    @entry = Entry.find_by(id:params[:entry_id])
    @user = User.find_by(id:params[:user_id])
    @specific_food = Food.find_by(id: params[:id])