app/controllers/foods_controller.rb

INSERT INTO "users_foods" ("user_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["food_id", 116], ["created_at", "2015-10-30 06:02:20.227281"], ["updated_at", "2015-10-30 06:02:20.227281"]]
---
  def create
    food_attr = params.require(:food).permit(:name)
    @food = Food.find_by(food_attr)
    @new_entry = UsersFood.create(user_id: current_user.id, food_id: @food.id)